[{"termL": ["John McCain"], "tfidf": 0.0030647543853490134, "termNL": [15], "filenameL": ["doc2.txt"], "sentenceL": ["The Republican nominee, John McCain, has worn the uniform of our country with bravery and distinction, and for that we owe him our gratitude and respect.", "But the record's clear: John McCain has voted with George Bush ninety percent of the time.", "It's not because John McCain doesn't care.", "It's because John McCain doesn't get it.\n", "I don't know what kind of lives John McCain thinks that celebrities lead, but this has been mine.", "Unlike John McCain, I will stop giving tax breaks to corporations that ship jobs overseas, and I will start giving them to companies that create good jobs right here in America.\n", "Washington's been talking about our oil addiction for the last thirty years, and John McCain has been there for twenty-six of them.", "If John McCain wants to have a debate about who has the temperament, and judgment, to serve as the next Commander-in-Chief, that's a debate I'm ready to have.\n", "When John McCain said we could just \"muddle through\" in Afghanistan, I argued for more resources and more troops to finish the fight against the terrorists who actually attacked us on 9/11, and made clear that we must take out Osama bin Laden and his lieutenants if we have them in our sights.", "John McCain likes to say that he'll follow bin Laden to the Gates of Hell - but he won't even go to the cave where he lives.\n", "And today, as my call for a time frame to remove our troops from Iraq has been echoed by the Iraqi government and even the Bush Administration, even after we learned that Iraq has a $79 billion surplus while we're wallowing in deficits, John McCain stands alone in his stubborn refusal to end a misguided war.\n", "If John McCain wants to follow George Bush with more tough talk and bad strategy, that is his choice - but it is not the change we need.\n", "And in the weeks ahead, I look forward to debating them with John McCain.\n", "I love this country, and so do you, and so does John McCain.", "So I've got news for you, John McCain."]}, {"termL": ["Nunn-Lugar", "Lugar"], "tfidf": 0.002235981591590454, "termNL": [6, 3], "filenameL": ["doc6.txt"], "sentenceL": ["First, the Nunn-Lugar program should be more engaged in containing proliferation threats from Soviet-supplied, civilian research reactors throughout Russia and the Independent States.\n", "In the years ahead, this should become an increasing priority for the Nunn-Lugar program, the Congress, and the Russians, who are already taking important steps to help implement these programs.\n", "For years, Nunn-Lugar programs have been effectively upgrading security at sites in six countries across the former Soviet Union.", "We need to be sure that Nunn-Lugar is increasingly focused on these very real non-proliferation and bioterrorism threats.\n", "Outstanding career officials who run the Nunn-Lugar program -- people like Col. Jim Reid and Andy Weber who are here this morning -- will be there every step of the way to ensure that U.S. interests are protected.\n", "And it means more sustained engagement, including more senior-level visits to Nunn-Lugar program sites.\n", "As some of you know, Senator Lugar and I recently traveled to Russia, Ukraine, and Azerbaijan to witness firsthand both the progress we're making in securing the world's most dangerous weapons, as well as the serious challenges that lie ahead.\n", "At this point I turned around and said \"Hey, where's Lugar?", "My third recommendation - which I'll just touch briefly on and let Senator Lugar talk about in more detail - is that we need to start thinking creatively about some of the next-generation efforts on nuclear, biological, and chemical weapons.\n"]}, {"termL": ["Russians", "Russia"], "tfidf": 0.002732866389721666, "termNL": [5, 6], "filenameL": ["doc6.txt"], "sentenceL": ["In the years ahead, this should become an increasing priority for the Nunn-Lugar program, the Congress, and the Russians, who are already taking important steps to help implement these programs.\n", "One way we could strengthen this relationship is by thinking about the Russians as more of a partner and less of a subordinate in the Cooperative Threat Reduction effort.\n", "Time and time again on the trip, I saw their skill and experience when negotiating with the Russians.", "But thinking of the Russians more as partners does mean being more thoughtful, respectful, and consistent about what we say and what we do.", "It means that the Russians can and should do more to support these programs.", "As some of you know, Senator Lugar and I recently traveled to Russia, Ukraine, and Azerbaijan to witness firsthand both the progress we're making in securing the world's most dangerous weapons, as well as the serious challenges that lie ahead.\n", "With the situation in Russia and the rest of the former Soviet Union so drastically different than it was in 1991, or even in 1996 or 2001, what must we do to effectively confront this threat in the days and years to come?\n", "First, the Nunn-Lugar program should be more engaged in containing proliferation threats from Soviet-supplied, civilian research reactors throughout Russia and the Independent States.\n", "One of the most important steps is for Russia to permit the access and transparency necessary to deal with the threat.\n", "Additionally, in the last few years, we've seen some disturbing trends from Russia itself - the deterioration of democracy and the rule of law, the abuses that have taken place in Chechnya, Russian meddling in the former Soviet Union - that raise serious questions about our relationship.\n", "But when we think about the threat that these weapons pose to our global security, we cannot allow the U.S.-Russian relationship to deteriorate to the point where Russia does not think it's in their best interest to help us finish the job we started."]}, {"termL": ["African"], "tfidf": 0.0024225188283751044, "termNL": [8], "filenameL": ["doc4.txt"], "sentenceL": ["In many ways, then, my family's life reflects some of the contradictions of Kenya, and indeed, the African continent as a whole.", "But for all the progress that has been made, we must surely acknowledge that neither Kenya nor the African continent have yet fulfilled their potential - that the hopefulness of the post-colonial era has been replaced by cynicism and sometimes despair, and that true freedom has not yet been won for those struggling to live on less than a few shillings a day, for those who have fallen prey to HIV/AIDS or malaria, to those ordinary citizens who continue to find themselves trapped in the crossfire of war or ethnic conflict.\n", "And we know how much this land is blessed - just as the entire African continent is blessed - with great gifts and riches.\n", "Kenya, like many African nations did not come of age under the best historical circumstances.", "When African nations were just gaining independence, industrialized nations had decades of experience building their domestic economies and navigating the international financial system.", "As a result, many African nations have been asked to liberalize their markets without reciprocal concessions from mature economies.", "Among African nations, Kenya remains a model for representative democracy - a place where many different ethnic factions have found a way to live and work together in peace and stability.", "It's not just a Kenyan problem, or an African problem."]}, {"termL": ["Ukraine"], "tfidf": 0.001987539192524848, "termNL": [4], "filenameL": ["doc6.txt"], "sentenceL": ["As some of you know, Senator Lugar and I recently traveled to Russia, Ukraine, and Azerbaijan to witness firsthand both the progress we're making in securing the world's most dangerous weapons, as well as the serious challenges that lie ahead.\n", "We were in Ukraine, visiting a pathogen laboratory in Kiev.", "And the Kiev story is heading in the right direction - while we were in Ukraine, Dick, through his tireless and personal intervention, was able to achieve a breakthrough with that government, bringing that facility and others under the Cooperative Threat Reduction program.\n", "While the government of Ukraine is making progress here, the limited funding they have means that at the current pace, it will take sixty years to dismantle these weapons."]}, {"termL": ["facility"], "tfidf": 0.001987539192524848, "termNL": [4], "filenameL": ["doc6.txt"], "sentenceL": ["This is a city of two and a half million, and in a non-descript building right in the middle of town stood this facility that once operated on the fringes of the Soviet biological weapons program.\n", "The Department of Energy and others have certainly made progress in converting civilian reactors to low-enriched uranium, taking back spent fuel, and closing unnecessary facilities.\n", "Many of these aging research facilities have the largest, least secure quantities of highly enriched uranium in the world - the quickest way to a nuclear weapon.", "And the Kiev story is heading in the right direction - while we were in Ukraine, Dick, through his tireless and personal intervention, was able to achieve a breakthrough with that government, bringing that facility and others under the Cooperative Threat Reduction program.\n"]}, {"termL": ["relationship"], "tfidf": 0.001987539192524848, "termNL": [4], "filenameL": ["doc6.txt"], "sentenceL": ["For any of these efforts that I've mentioned to work as we move forward, we must also think critically and strategically about Washington's relationship with Moscow.\n", "Additionally, in the last few years, we've seen some disturbing trends from Russia itself - the deterioration of democracy and the rule of law, the abuses that have taken place in Chechnya, Russian meddling in the former Soviet Union - that raise serious questions about our relationship.\n", "But when we think about the threat that these weapons pose to our global security, we cannot allow the U.S.-Russian relationship to deteriorate to the point where Russia does not think it's in their best interest to help us finish the job we started.", "One way we could strengthen this relationship is by thinking about the Russians as more of a partner and less of a subordinate in the Cooperative Threat Reduction effort.\n"]}, {"termL": ["corruption"], "tfidf": 0.0019106280664615335, "termNL": [20], "filenameL": ["doc4.txt", "doc3.txt"], "sentenceL": ["One that serves its people and is free from corruption.\n", "It is being threatened by corruption.\n", "Corruption is not a new problem.", "But while corruption is a problem we all share, here in Kenya it is a crisis - a crisis that's robbing an honest people of the opportunities they have fought for - the opportunity they deserve.\n", "It is painfully obvious that corruption stifles development - it siphons off scarce resources that could improve infrastructure, bolster education systems, and strengthen public health.", "In fact, one recent survey showed that corruption in Kenya costs local firms 6% of their revenues, the difference between good-paying jobs in Kenya or somewhere else.", "And corruption also erodes the state from the inside out, sickening the justice system until there is no justice to be found, poisoning the police forces until their presence becomes a source of insecurity rather than comfort.\n", "Corruption has a way of magnifying the very worst twists of fate.", "What's worse - corruption can also provide opportunities for those who would harness the fear and hatred of others to their agenda and ambitions.\n", "Terrorist attacks - like those that have shed Kenyan blood and struck at the heart of the Kenyan economy - are facilitated by customs and border officers who can be paid off, by police forces so crippled by corruption that they do not protect the personal safety of Kenyans walking the streets of Nairobi, and by forged documents that are easy to find in a climate where graft and fraud thrive.\n", "Some of the worst actors on the international stage can also take advantage of the collective exhaustion and outrage that people feel with official corruption, as we've seen with Islamic extremists who promise purification, but deliver totalitarianism.", "Endemic corruption opens the door to this kind of movement, and in its wake comes a new set of distortions and betrayals of public trust.\n", "And this is why the struggle against corruption is one of the great struggles of our time.\n", "Willingness to report corruption is increasingly significantly in Kenya.", "The Kenyan people are crying out for real change, and whether one voted orange or banana in last year's referendum, the message that many Kenyans seemed to be sending was one of dissatisfaction with the pace of reform, and real frustration with continued tolerance of corruption at high levels.\n", "Clarifying these rules and focusing resources on building a judicial system that can enforce them and resolve disputes should be a primary goal of any government suffering from corruption.\n", "Of course, in the end, one of the strongest weapons your country has against corruption is the ability of you, the people, to stand up and speak out about the injustices you see.", "The world knows the names of Wangari Maathai and John Githongo, who are fighting against the insidious corruption that has weakened Kenya.", "By rejecting the insulting idea that corruption is somehow a part of Kenyan culture, these heroes reveal the very opposite -", "In a century just six years old, our faith has been shaken by war and terror, disaster and despair, threats to the middle-class dream, and scandal and corruption in our government.\n"]}, {"termL": ["redeployment"], "tfidf": 0.0018413782336779547, "termNL": [8], "filenameL": ["doc5.txt"], "sentenceL": ["When I came here and gave a speech on this war a year ago, I suggested that we begin to move towards a phased redeployment of American troops from Iraqi soil.", "a phased redeployment of U.S. troops from Iraq on a timetable that would begin in four to six months.\n", "When I first advocated steps along these lines over a year ago, I had hoped that this phased redeployment could begin by the end of 2006.", "For only through this phased redeployment can we send a clear message to the Iraqi factions that the U.S. is not going to hold together this country indefinitely ?", "He should then work with our military commanders to map out the best plan for such a redeployment and determine precise levels and dates.", "The redeployment could be temporarily suspended if the parties in Iraq reach an effective political arrangement that stabilizes the situation and they offer us a clear and compelling rationale for maintaining certain troop levels.", "As a phased redeployment is executed, the majority of the U.S. troops remaining in Iraq should be dedicated to the critical, but less visible roles, of protecting logistics supply points, critical infrastructure, and American enclaves like the Green Zone, as well as acting as a rapid reaction force to respond to emergencies and go after terrorists.\n", "The second part of our strategy should be to couple this phased redeployment with a more effective plan that puts the Iraqi security forces in the lead, intensifies and focuses our efforts to train those forces, and expands the numbers of our personnel ?"]}, {"termL": ["Kenyans", "Kenyan"], "tfidf": 0.0028767411086954363, "termNL": [6, 13], "filenameL": ["doc4.txt"], "sentenceL": ["Certainly it is not due to lack of effort on the part of ordinary Kenyans - we know how hard Kenyans are willing to work, the tremendous sacrifices that Kenyan mothers make for their children, the Herculean efforts that Kenyan fathers make for their families.", "There is no doubt that what Kenyans have accomplished with this independence is both impressive and inspiring.", "I know that while recent reports have pointed to strong economic growth in this country, 56% of Kenyans still live in poverty.", "Terrorist attacks - like those that have shed Kenyan blood and struck at the heart of the Kenyan economy - are facilitated by customs and border officers who can be paid off, by police forces so crippled by corruption that they do not protect the personal safety of Kenyans walking the streets of Nairobi, and by forged documents that are easy to find in a climate where graft and fraud thrive.\n", "The Kenyan people are crying out for real change, and whether one voted orange or banana in last year's referendum, the message that many Kenyans seemed to be sending was one of dissatisfaction with the pace of reform, and real frustration with continued tolerance of corruption at high levels.\n", "It's not just a Kenyan problem, or an African problem.", "The Kenyan media has been courageous in uncovering and reporting on some of the most blatant abuses of the system, and there has been a growing recognition among people and politicians that this is a critical issue.\n", "Today, we're starting to see that the Kenyan people want more than a simple changing of the guard, more than piecemeal reforms to a crisis that's crippling their country.", "In addition, we know that the more information the public is provided, the easier it will be for your Kenyan brothers and sisters out in the villages to evaluate whether they are being treated fairly by their public servants or not.", "The Kenyan people are the ultimate guardians against abuses.\n", "As well as numerous Kenyan men and women who have refused to pay bribes to get civil servants to perform their duties; the auditors and inspectors general who have done the job before them accurately and fairly, regardless of where the facts have led; the journalists who asked questions and pushed for answers when it may have been more lucrative to look the other way, or whip up a convenient fiction.", "And then there are anonymous Kenyan whistleblowers who show us what is, so that we can all work together to demand what should be.\n", "By rejecting the insulting idea that corruption is somehow a part of Kenyan culture, these heroes reveal the very opposite -"]}, {"termL": ["Iraqi"], "tfidf": 0.001807125297112926, "termNL": [25], "filenameL": ["doc5.txt", "doc2.txt"], "sentenceL": ["When I came here and gave a speech on this war a year ago, I suggested that we begin to move towards a phased redeployment of American troops from Iraqi soil.", "300,000 Iraqi security forces have supposedly been recruited and trained over the last two years, and yet American troop levels have not been reduced by a single soldier.", "“rejected the notion of an American ‘timeline’ for action on urgent Iraqi political issues; ordered American commanders to lift checkpoints they had set up around the Shiite district of Sadr City to hunt for a kidnapped American soldier and a fugitive Shiite death squad leader; and blamed the Americans for the deteriorating security situation in Iraq.”\n", "to pressure the Iraqi leadership to finally come to a political agreement between the warring factions that can create some sense of stability in the country and bring this conflict under control.\n", "The first part of this strategy begins by exerting the greatest leverage we have on the Iraqi government ?", "For only through this phased redeployment can we send a clear message to the Iraqi factions that the U.S. is not going to hold together this country indefinitely ?", "The President should announce to the Iraqi people that our policy will include a gradual and substantial reduction in U.S. forces.", "When possible, this should be done in consultation with the Iraqi government ?", "but it should not depend on Iraqi approval.\n", "But only if U.S. commanders think such a force would be effective; if there is substantial movement towards a political solution among Iraqi factions; if the Iraqi government showed a serious commitment to disbanding the militias; and if the Iraqi government asked us ?", "We would make clear in such a scenario that the United States would not be maintaining permanent military bases in Iraq, but would do what was necessary to help prevent a total collapse of the Iraqi state and further polarization of Iraqi society.", "The second part of our strategy should be to couple this phased redeployment with a more effective plan that puts the Iraqi security forces in the lead, intensifies and focuses our efforts to train those forces, and expands the numbers of our personnel ?", "who are deployed with Iraqi as units advisers.\n", "An increase in the quality and quantity of U.S. personnel in training and advisory roles can guard against militia infiltration of Iraqi units; develop the trust and goodwill of Iraqi soldiers and the local populace; and lead to better intelligence while undercutting grassroots support for the insurgents.\n", "In the absence of a genuine commitment on the part of all of the factions in Iraq to deal with this issue, it is doubtful that a unified Iraqi government can function for long, and it is doubtful that U.S. forces, no matter how large, can prevent an escalation of widespread sectarian killing.\n", "Of course, in order to convince the various factions to embark on the admittedly difficult task of disarming their militias, the Iraqi government must also make headway on reforming the institutions that support the military and the police.", "We can teach the soldiers to fight and police to patrol, but if the Iraqi government will not properly feed, adequately pay, or provide them with the equipment they need, they will continue to desert in large numbers, or maintain fealty only to their religious group rather than the national government.", "Today, the Iraqi landscape is littered with ill-conceived, half-finished projects that have done almost nothing to help the Iraqi people or stabilize the country.\n", "The goal of this conference should be to get foreign fighters out of Iraq, prevent a further descent into civil war, and push the various Iraqi factions towards a political solution.\n", "And today, as my call for a time frame to remove our troops from Iraq has been echoed by the Iraqi government and even the Bush Administration, even after we learned that Iraq has a $79 billion surplus while we're wallowing in deficits, John McCain stands alone in his stubborn refusal to end a misguided war.\n"]}, {"termL": ["continent"], "tfidf": 0.00151407426773444, "termNL": [5], "filenameL": ["doc4.txt"], "sentenceL": ["In many ways, then, my family's life reflects some of the contradictions of Kenya, and indeed, the African continent as a whole.", "But for all the progress that has been made, we must surely acknowledge that neither Kenya nor the African continent have yet fulfilled their potential - that the hopefulness of the post-colonial era has been replaced by cynicism and sometimes despair, and that true freedom has not yet been won for those struggling to live on less than a few shillings a day, for those who have fallen prey to HIV/AIDS or malaria, to those ordinary citizens who continue to find themselves trapped in the crossfire of war or ethnic conflict.\n", "And we know how much this land is blessed - just as the entire African continent is blessed - with great gifts and riches.\n", "A foreign policy that gives hope and opportunity to the people of this great continent.\n", "Like many nations across this continent, where Kenya is failing is in its ability to create a government that is transparent and accountable."]}, {"termL": ["Kiev"], "tfidf": 0.001490654394393636, "termNL": [3], "filenameL": ["doc6.txt"], "sentenceL": ["We were in Ukraine, visiting a pathogen laboratory in Kiev.", "While they are often difficult to use, they are easy to transport, hard to detect, and, as we saw in Kiev, not always well secured.\n", "And the Kiev story is heading in the right direction - while we were in Ukraine, Dick, through his tireless and personal intervention, was able to achieve a breakthrough with that government, bringing that facility and others under the Cooperative Threat Reduction program.\n"]}, {"termL": ["building"], "tfidf": 0.001490654394393636, "termNL": [3], "filenameL": ["doc6.txt"], "sentenceL": ["This is a city of two and a half million, and in a non-descript building right in the middle of town stood this facility that once operated on the fringes of the Soviet biological weapons program.\n", "We entered through no fences or discernible security, and once we did, we found ourselves in a building with open first-floor windows and padlocks that many of us would not use to secure our own luggage.\n", "Five postal employees were killed and the Senate office buildings were closed for months.\n"]}, {"termL": ["Soviet"], "tfidf": 0.001490654394393636, "termNL": [3], "filenameL": ["doc6.txt"], "sentenceL": ["This is a city of two and a half million, and in a non-descript building right in the middle of town stood this facility that once operated on the fringes of the Soviet biological weapons program.\n", "We've heard the horror stories - attempts by rogue states to recruit former Soviet weapons scientists; terrorists shopping for weapons grade materials on the black market.", "But because of the size, secrecy, and scope of the Soviet biological weapons program, we are still dangerously behind in dealing with this proliferation threat."]}, {"termL": ["anthrax"], "tfidf": 0.001490654394393636, "termNL": [3], "filenameL": ["doc6.txt"], "sentenceL": ["Some of the tubes, he said, were filled with anthrax.", "At its height in the late 1980's, this program stockpiled of some of the most dangerous agents known to man - plague, smallpox, and anthrax - to name just a few.", "Here in Washington, we saw what happened when just two letters filled with just a few grams of Anthrax were sent to the U.S. Senate."]}, {"termL": ["civilian"], "tfidf": 0.001490654394393636, "termNL": [3], "filenameL": ["doc6.txt"], "sentenceL": ["First, the Nunn-Lugar program should be more engaged in containing proliferation threats from Soviet-supplied, civilian research reactors throughout Russia and the Independent States.\n", "The Department of Energy and others have certainly made progress in converting civilian reactors to low-enriched uranium, taking back spent fuel, and closing unnecessary facilities.\n", "Besides the devastation they can cause to a civilian population, biological agents can also be effective in asymmetrical warfare against U.S. troops."]}, {"termL": ["site"], "tfidf": 0.001490654394393636, "termNL": [3], "filenameL": ["doc6.txt"], "sentenceL": ["For years, Nunn-Lugar programs have been effectively upgrading security at sites in six countries across the former Soviet Union.", "And it means more sustained engagement, including more senior-level visits to Nunn-Lugar program sites.\n", "It's important for senior officials to go and visit these sites, to check their progress and shortcomings; to see what's working and what's not."]}, {"termL": ["phase"], "tfidf": 0.0013810336752584662, "termNL": [6], "filenameL": ["doc5.txt"], "sentenceL": ["When I came here and gave a speech on this war a year ago, I suggested that we begin to move towards a phased redeployment of American troops from Iraqi soil.", "a phased redeployment of U.S. troops from Iraq on a timetable that would begin in four to six months.\n", "When I first advocated steps along these lines over a year ago, I had hoped that this phased redeployment could begin by the end of 2006.", "For only through this phased redeployment can we send a clear message to the Iraqi factions that the U.S. is not going to hold together this country indefinitely ?", "As a phased redeployment is executed, the majority of the U.S. troops remaining in Iraq should be dedicated to the critical, but less visible roles, of protecting logistics supply points, critical infrastructure, and American enclaves like the Green Zone, as well as acting as a rapid reaction force to respond to emergencies and go after terrorists.\n", "The second part of our strategy should be to couple this phased redeployment with a more effective plan that puts the Iraqi security forces in the lead, intensifies and focuses our efforts to train those forces, and expands the numbers of our personnel ?"]}, {"termL": ["maintain"], "tfidf": 0.0013810336752584662, "termNL": [6], "filenameL": ["doc5.txt"], "sentenceL": ["namely, preventing Iraq from becoming what Afghanistan once was, maintaining our influence in the Middle East, and forging a political settlement to stop the sectarian violence so that our troops can come home.\n", "They have battled insurgents, secured cities, and maintained some semblance of order in Iraq.", "The redeployment could be temporarily suspended if the parties in Iraq reach an effective political arrangement that stabilizes the situation and they offer us a clear and compelling rationale for maintaining certain troop levels.", "We would make clear in such a scenario that the United States would not be maintaining permanent military bases in Iraq, but would do what was necessary to help prevent a total collapse of the Iraqi state and further polarization of Iraqi society.", "We can teach the soldiers to fight and police to patrol, but if the Iraqi government will not properly feed, adequately pay, or provide them with the equipment they need, they will continue to desert in large numbers, or maintain fealty only to their religious group rather than the national government.", "And so we need to maintain a strong foreign policy, relentless in pursuing our enemies and hopeful in promoting our values around the world.\n"]}, {"termL": ["biological"], "tfidf": 0.001326608882653708, "termNL": [9], "filenameL": ["doc6.txt", "doc5.txt"], "sentenceL": ["This is a city of two and a half million, and in a non-descript building right in the middle of town stood this facility that once operated on the fringes of the Soviet biological weapons program.\n", "And that is why the nuclear, chemical, and biological weapons within the borders of the former Soviet Union represent the greatest threat to the security of the United States - a threat we need to think seriously and intelligently about in the months to come.\n", "I want to turn to a second critical area: biological weapons threat reduction programs.\n", "Besides the devastation they can cause to a civilian population, biological agents can also be effective in asymmetrical warfare against U.S. troops.", "But because of the size, secrecy, and scope of the Soviet biological weapons program, we are still dangerously behind in dealing with this proliferation threat.", "As the Avian Influenza outbreak demonstrates, even the zealous Russian border guard is helpless against the global sweep of biological threats.\n", "My third recommendation - which I'll just touch briefly on and let Senator Lugar talk about in more detail - is that we need to start thinking creatively about some of the next-generation efforts on nuclear, biological, and chemical weapons.\n", "And we need to work together to obtain a bilateral agreement on biological threat reduction.\n", "And on a trip to the former Soviet Union, I have seen the biological and nuclear weapons terrorists could easily steal while the world looks the other way.\n"]}, {"termL": ["sew"], "tfidf": 0.0012122618357717073, "termNL": [4], "filenameL": ["doc3.txt"], "sentenceL": ["I did not need sewing either.", "I knew how to sew.", "I don't need to sew to go to college.", "My mother sews."]}, {"termL": ["discover"], "tfidf": 0.0012112594141875522, "termNL": [4], "filenameL": ["doc4.txt"], "sentenceL": ["To begin with, I discovered the warmth and sense of community that the people of Kenya possess - their sense of hopefulness even in the face of great difficulty.", "I discovered the beauty of the land, a beauty that haunts you long after you've left.\n", "And most importantly for me, I discovered the story of my father's life, and the story of his father before him.\n", "And yet, I discovered that for all his education, my father's life ended up being filled with disappointments."]}, {"termL": ["village"], "tfidf": 0.0012112594141875522, "termNL": [4], "filenameL": ["doc4.txt"], "sentenceL": ["I learned that my grandfather had been a cook for the British and, although he was a respected elder in his village, he was called \"boy\" by his employers for most of his life.", "I learned how my father had grown up in a tiny village called Alego, near Siaya, during this period of tumult.", "And on a more personal level, because he never fully reconciled the traditions of his village with more modern conceptions of family - because he related to women as his father had, expecting them to obey him no matter what he did - his family life was unstable, and his children never knew him well.\n", "In addition, we know that the more information the public is provided, the easier it will be for your Kenyan brothers and sisters out in the villages to evaluate whether they are being treated fairly by their public servants or not."]}, {"termL": ["bribe"], "tfidf": 0.0012112594141875522, "termNL": [4], "filenameL": ["doc4.txt"], "sentenceL": ["In just the last year, our own U.S. Congress has seen a representative resign after taking bribes, and several others fall under investigation for using their public office for private gain.\n", "We know that the temptation to take a bribe is greater when you're not making enough on the job.", "And we also know that the more people there are on the government payroll, the more likely it is that someone will be encouraged to take a bribe.", "As well as numerous Kenyan men and women who have refused to pay bribes to get civil servants to perform their duties; the auditors and inspectors general who have done the job before them accurately and fairly, regardless of where the facts have led; the journalists who asked questions and pushed for answers when it may have been more lucrative to look the other way, or whip up a convenient fiction."]}]